In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
#check sqlalchemy
import sqlalchemy
print (sqlalchemy.__version__ )

1.4.22

In [12]:
df.columns

Index(['entry_date', 'property_type', 'Tipology', 'Condition', 'Location',
       'Price', 'areas_sqm', 'euros/sqm', 'Latitude', 'Longitude',
       'Location_2', 'CodPostal', 'quartos', 'Cod_Condition'],
      dtype='object')

In [15]:
#load data from database
def load_data():
    engine = create_engine('sqlite:///casas.db')
    df = pd.read_sql("SELECT * FROM casas", engine) 
    X = df[['property_type', 'Tipology', 'Condition', 'Location', 'areas_sqm', 'quartos','Latitude', 'Longitude', 'CodPostal', 'Cod_Condition']]
    y = df[['Price']]
    return X, y

In [16]:
X.head()

,property_type,Tipology,Condition,Location,areas_sqm,quartos,Latitude,Longitude,CodPostal,Cod_Condition
0,Apartments,T2,Used,"Aveiro, Aradas",96,2,40.6175,-8.647778,3810,4
1,Apartments,T2,Used,"Aveiro, Aradas",119,2,40.6175,-8.647778,3810,4
2,Apartments,T2,Used,"Aveiro, Aradas",72,2,40.6175,-8.647778,3810,4
3,Apartments,T2,Used,"Aveiro, Aradas",90,2,40.6175,-8.647778,3810,4
4,Apartments,T2,New,"Aveiro, Aradas",126,2,40.6175,-8.647778,3810,6

In [17]:
y.head()

    Price
0  145000
1  155000
2  118000
3  185000
4  295000

In [18]:
X,y = load_data()

In [19]:
X.shape, y.shape

((4180, 10), (4180, 1))

In [ ]:
# correr os modelos de machine learning
# ir buscar as funções no notebook do Alexandre
#o que não estiver dentro de uma função colocar

In [ ]:
#split data
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.3, random_state=42)
#etc.

In [ ]:
# desenvolver o mapa